{
    "name": "Scenario_PreAlpha_BattleTutorial",
    "journelText": "Welcome to the battle tutorial. Once you finish reading this you'll be taken to the pre-battle screen for the first battle, from there you will move on to the battle itself.\n\nThe goal of each battle is to defeat all of the oncoming undead while protecting your necromancer. You do this by summoning and positioning your minions on the battle grid.[PAGE BREAK]The bookmark in the bottom left of the battle screen will open the minion rooster, from there you can summon minions by clicking on their icon and then on the grid space you want to summon them in. Summoning minions costs dark energy which doubles as your necromancers health so you may not want to always summon every minion.\n\nYour minions will automatically attack any enemy that comes into range however most attacks will only target enemies in the same row as the minion. In addition, minions will not attack enemies that they are not facing. You can change a minions facing by selecting them and hiting the switch facing button at the bottom of the screen or pressing the F key with the minion selected.\n\nYou can select and move minions by left clicking on them and then left clicking on an empty grid space. Note: Minions can not move to a space occupied by another minion or one that another minion is already moving to.[PAGE BREAK]Each minion has a set of 3 abilities, some are passive(indicated by a shaded border) while some are active, requiring you to order the minion to use them. You can order a minion to use an ability by selecting the minion and clicking on the corresponding ability button at the bottom of the screen. Abilities that target a space or minion will require you to also click on the space or minion you wish to target.\n\nAt the start of the battle you will have all the time in the world to summon and set up your minions. Once you are happy with their placement you can hit the start battle button to begin the battle. Don't worry as you can still control your minions and summon new ones once the battle starts.[PAGE BREAK]Finally, during a battle you can create a new minion by converting an enemy. To convert an enemy, select your necromancer and cast the conversition ritual ability on an enemy. Then you must kill enough enemies before the battle ends to complete the ritual. If you kill enough enemies, a new minion will be added to your roster, if you fail then the targeted enemy will rejoin the battle and must be killed. [PAGE BREAK] [BUTTON](BATTLE_PreAlpha Tutorial Horde[_]PostBattle_PreAlpha_Tutorial){Onwards to battle}"
}